Revit 2024 API
HermiteSpline Class
A Hermite spline.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class HermiteSpline : Curve
Visual Basic
Public Class HermiteSpline _
	Inherits Curve
Visual C++
public ref class HermiteSpline : public Curve
Remarks
The Hermite spline lies in the plane defined by control points.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.GeometryObject
 Autodesk.Revit.DB.Curve
 Autodesk.Revit.DB.HermiteSpline
See Also
HermiteSpline Members
Autodesk.Revit.DB Namespace